ckcd1hp/First-Test-ESP32/src/main.cpp
    // update web page every minute
    if (rtc.getSecond() == 0)
    {
      if (!pump2StatusUpdated and pump2OverrideTimeEpochEnd != 0)
      {
        // Send Events to the Web Client with the Sensor Readings
        String command = (pump2Command) ? "On " : "Off ";
        String timeLeft = command + "(Override " + String((pump2OverrideTimeEpochEnd - rtc.getEpoch()) / 60) + " min)";
        events.send(timeLeft.c_str(), "pump2Command", millis());
        pump2StatusUpdated = true;
      }
    }
    else
      pump2StatusUpdated = false;
    // if pump2OverrideTimeEpochEnd is 0 and pump is in override, then override is permanent
    if (rtc.getEpoch() >= pump2OverrideTimeEpochEnd and pump2OverrideTimeEpochEnd != 0)
    {
      setPumpAuto(WATER_PUMP_2_PIN);
    }
  }
  // set pump1 command
  digitalWrite(WATER_PUMP_1_PIN, pump1Command ? HIGH : LOW);
  // set pump2 command
  digitalWrite(WATER_PUMP_2_PIN, pump2Command ? HIGH : LOW);
}
void updatePumpStatuses()
{
  // Send Events to the Web Client with the pump statuses (every 10 seconds)
  String p1String = (pump1Status) ? "<span class = \"status online\"></ span>" : "<span class=\" status offline \"></span> ";
  String p2String = (pump2Status) ? "<span class = \"status online\"></ span>" : "<span class=\" status offline \"></span> ";
  String airPString = (airPumpStatus) ? "<span class = \"status online\"></ span>" : "<span class=\" status offline \"></span> ";
  events.send(p1String.c_str(), "pump1Status", millis());
  events.send(p2String.c_str(), "pump2Status", millis());
  events.send(airPString.c_str(), "airPumpStatus", millis());
}
void checkPumpAlarms()
{
  if (pump1Command != pump1Status)
  {
    if (pump1AlarmTimeEpochEnd == 0)
    {
      // first instance of mismatch, start timer if not already in alarm
      if (!pump1Alarm)
      {
        pump1AlarmTimeEpochEnd = rtc.getEpoch() + 60; // 1 minute timer
        Serial.println("Starting pump1 alarm timer");
      }
    }
    else
    {
      if (rtc.getEpoch() >= pump1AlarmTimeEpochEnd)
      {
        // set alarm
        pump1Alarm = true;
        pump1AlarmTimeEpochEnd = 0;
        String p1Alarm = "<i class = \"fas fa-bell\" style = \"color:#c81919;\"></ i> Water Pump 1";
        events.send(p1Alarm.c_str(), "waterPump1Header", millis());
        Serial.println("Pump1 alarm active");
      }
    }
  }
  else
  {
    // reset alarm
    // as soon as status matches, clear timer
    pump1AlarmTimeEpochEnd = 0;
    if (pump1Alarm)
    {
      pump1Alarm = false;
      String p1 = "Water Pump 1";
      events.send(p1.c_str(), "waterPump1Header", millis());
      Serial.println("Pump1 alarm cleared");
    }
  }
  // check pump2
  if (pump2Command != pump2Status)
  {
    if (pump2AlarmTimeEpochEnd == 0)
    {
      // first instance of mismatch, start timer if not already in alarm
      if (!pump2Alarm)
      {
        pump2AlarmTimeEpochEnd = rtc.getEpoch() + 60; // 1 minute timer
        Serial.println("Starting pump2 alarm timer");
      }
    }
    else
    {
      if (rtc.getEpoch() >= pump2AlarmTimeEpochEnd)
      {
        // set alarm
        pump2Alarm = true;
        pump2AlarmTimeEpochEnd = 0;
        String p2Alarm = "<i class = \"fas fa-bell\" style = \"color:#c81919;\"></ i> Water Pump 2";
        events.send(p2Alarm.c_str(), "waterPump2Header", millis());
        Serial.println("Pump2 alarm active");
      }
    }
  }
  else
  {
    // reset alarm
    // as soon as status matches, clear timer
    pump2AlarmTimeEpochEnd = 0;
    if (pump2Alarm)
    {
      pump2Alarm = false;
      String p2 = "Water Pump 2";
      events.send(p2.c_str(), "waterPump2Header", millis());
      Serial.println("Pump2 alarm cleared");
    }
  }
  // check air pump
  if (airPumpCommand != airPumpStatus)
  {
    if (airPumpAlarmTimeEpochEnd == 0)
    {
      // first instance of mismatch, start timer if not already in alarm
      if (!airPumpAlarm)
      {
        airPumpAlarmTimeEpochEnd = rtc.getEpoch() + 60; // 1 minute timer
        Serial.println("Starting air pump alarm timer");
      }
    }
    else
    {
      if (rtc.getEpoch() >= airPumpAlarmTimeEpochEnd)
      {
        // set alarm
        airPumpAlarm = true;
        airPumpAlarmTimeEpochEnd = 0;
        String airPumpAlarm = "<i class = \"fas fa-bell\" style = \"color:#c81919;\"></ i> Air Pump";
        events.send(airPumpAlarm.c_str(), "airPumpHeader", millis());
        Serial.println("Air pump alarm active");
      }
    }
  }
  else
  {
    // reset alarm
    // as soon as status matches, clear timer
    airPumpAlarmTimeEpochEnd = 0;
    if (airPumpAlarm)
    {
      airPumpAlarm = false;
      String p = "Air Pump";
      events.send(p.c_str(), "airPumpHeader", millis());
      Serial.println("Air Pump alarm cleared");
    }
  }
}
